app/controllers/bookmarklets_controller.rb

  def index
    @bookmarklets = Bookmarklet.all
---
SELECT * FROM "bookmarklets"

  def show
    @bookmarklet = Bookmarklet.find(params[:id])
---
SELECT * FROM "bookmarklets" WHERE ("bookmarklets"."id" = 1)

  def create
    @bookmarklet = Bookmarklet.new(params[:bookmarklet])

    respond_to do |format|
      if @bookmarklet.save
---
INSERT INTO "bookmarklets" ("name", "created_at", "code", "updated_at", "count") VALUES('Augmented GitHub', '2009-10-28 03:44:31', '(function($) {